//三级联动，数据是json数组
var data = [{
    "name": "北京市",
    "city": [{
      "name": "北京市",
      "area": ["东城区", "西城区", "宣武区", "朝阳区"]
    }]
  },
  {
    "name": "湖北省",
    "city": [{
        "name": "武汉市",
        "area": ["武昌区", "洪山区", "青山区", "江汉区", "江岸区", "汉阳区"]
      },
      {
        "name": "黄石市",
        "area": ["黄石港区", "西塞山区", "下陆区", "铁山区", "大冶市", "阳新县"]
      }
    ]
  },
  {
    "name": "湖南省",
    "city": [{
        "name": "长沙市",
        "area": ["岳麓区", "芙蓉区", "天心区", "浏阳市", "长沙县", "望城县"]
      },
      {
        "name": "湘潭市",
        "area": ["岳塘区", "雨湖区", "湘乡市", "韶山市", "湘潭县"]
      }
    ]
  }
];